Repository: tothambrus11/tic-tac-thrones
Catalog: src/locale/messages.*.xlf
Languages: hu

source: Home
hu: Kezdőlap

source: Undo
hu: Visszavonás

source: New Game
hu: Új játék

source: Back to home
hu: Vissza a kezdőlapra

source: A reimagined version of the legendary<br>tic-tac-toe game.
hu: A legendás amőba játék<br>újragondolt változata.

source: Local Game
hu: Lokális játék

source: Private Room
hu: Privát szoba

source: How to play?
hu: Szabályok

source: In this game the board is divided into simultaneous games of the classic children's game, tic-tac-toe. On your turn you can claim a square that is in the area determined by your opponents last move. If you win a small game of tic-tac-toe you can claim the region of the board it is on. If you have three of these regions in a line you win.
hu: Ebben a játékban a tábla fel van bontva 9 párhuzamosan játszott klasszikus amőbára. Amikor te jössz, le kell raknod egy X-et/O-t abba az amőbába, amelyiket az ellenfeled előző lépésben a kicsi amőba meghatározott. Ha megnyersz egy kis amőbát, azt a területet elfoglalja a te színed, és a játékot az nyeri, aki az ilyen területekből meg tudja nyerni a nagy amőbát.

source: About Us
hu: Rólunk

source: The creation of this game wouldn't be possible without these people:
hu: A játék nem jött volna létre ezek nélkül az emberek nélkül:

source: Zsombor Várkonyi
hu: Várkonyi Zsombor

source: Tic Tac Thrones has two fathers because of equality. He is one of them.
hu: A Tic Tac Thrones-nak két atyja van, ez a 21. század. Ő az egyik.

source: Immeral Balázs Horváth
hu: Horváth Balázs Immeral

source: And he is the other one. Also, it turned out, that there was already an existing game out there called Ultimate tic-tac-toe with the exact same rules. So they are now half-twins, I guess.
hu: Ő pedig a másik. Közben kiderült, hogy létezik egy másik játék Ultimate tic-tac-toe néven ugyanezekkel a szabályokkal, szóval úgy tűnik, lett egy ikertestvérünk.

source: Bence Hervay
hu: Hervay Bence

source: Bence coded Tic tac thrones the first time in p5js in less than an hour. He helped a lot in reviewing the final design of the game and was a continuous feedback source.
hu: Bence kódolta le a játék első verióját a p5js könyvtár segítségével kevesebb, mint egy óra alatt. Sokat segített a végleges kinézet kialakításában és a logó megtervezésében.

source: Ambrus Tóth
hu: Tóth Ambrus

source: Ambrus was just someone who found this game idea great, and wanted to take it to the next level. He completely redesigned the appearance, recoded the whole thing in Angular and designed a nice logo.
hu: Ambrus egy programozó, akinek megtetszett ez a játék, ezért újradizájnolta, újraírta Angularban egy Progressive Web Appba.

source: Frequently Asked Questions
hu: Gyakran ismételt kérdések

source: No one asked anything. <br> If you would like to do so, contact us at <a href="mailto:ambrus@johetajava.hu"> ambrus@johetajava.hu </a>
hu: Nem kérdezett senki semmit. <br> Ha te szeretnél, vedd fel velünk a kapcsolatot a <a href="mailto:ambrus@johetajava.hu"> ambrus@johetajava.hu </a> email címen!

source: Contact
hu: Kapcsolat

source: Whether you have a question about the game, or you would like to donate the authors, leave us an email at <a href="mailto:ambrus@johetajava.hu"> ambrus@johetajava.hu</a>!
hu: Ha van egy kérdésed a játékkal kapcsolatban, vagy szeretnéd támogatni a fejlesztőket, írj egy emailt a <a href="mailto:ambrus@johetajava.hu"> ambrus@johetajava.hu </a> címre!

source: Website: <a [href]="website"> {{website}} </a>
hu: Weboldal: <a [href]="website"> {{website}} </a>

source: FAQ
hu: GyIK
